app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "This is only a test, and this is a commercial"], ["created_at", Tue, 12 Mar 2013 18:17:12 UTC +00:00], ["updated_at", Tue, 12 Mar 2013 18:17:12 UTC +00:00], ["user_id", 1]]