app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1
---
  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(:page => params[:page])

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
   @user = User.new(params[:user])
   if @user.save

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(:page => params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "email" = 'haynescw@uwed.edu', "updated_at" = '2013-03-12 18:41:06.170661', "password_digest" = '$2a$10$fDla1bcgmPu1uZCz29kwwuCF5Ql3vKwIDZfAoG7f9Ikc..J28L38K', "remember_token" = 'fe8404d45f3b1ea1d2ed77f35451de72', "name" = 'Chris Haynes' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def following
    @title = "Following"
    @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def followers
    @title = "Followers"
    @user = User.find(params[:id])